app/Controllers/back/AdminRegimeController.php

SELECT *
FROM "regimes"
ORDER BY "libelle" ASC
---
    public function index()
    {
        $regimes = $this->regimeModel->orderBy('libelle', 'ASC')->findAll();

SELECT *
FROM "aliments"
ORDER BY "nom" ASC
---
    public function create()
    {
        $aliments = $this->alimentModel->orderBy('nom', 'ASC')->findAll();