app/Models/CodePromoModel.php

SELECT COUNT(*) AS "numrows"
FROM "codes_promo"
WHERE "status" = 'active'
---
    public function countByStatus(string $status)
    {
        return $this->db->table('codes_promo')->where('status', $status)->countAllResults();

SELECT "uc"."date_utilisation", "c"."code", "c"."status", "u"."nom"
FROM "utilisateurs_codes" "uc"
JOIN "codes_promo" "c" ON "c"."id" = "uc"."code_id"
JOIN "utilisateurs" "u" ON "u"."id" = "uc"."utilisateur_id"
ORDER BY "uc"."date_utilisation" DESC
 LIMIT 10
---
    public function codesRecemmentUtilises($limit = 10)
    {
        return $this->db->table('utilisateurs_codes uc')
            ->select('uc.date_utilisation, c.code, c.status, u.nom')
            ->join('codes_promo c', 'c.id = uc.code_id')
            ->join('utilisateurs u', 'u.id = uc.utilisateur_id')
            ->orderBy('uc.date_utilisation', 'DESC')
            ->limit($limit)
            ->get()
            ->getResultArray();