app/Models/CompteModel.php

SELECT *
FROM "comptes"
WHERE "utilisateur_id" = 3
 LIMIT 1
---
    public function getByUtilisateur(int $utilisateur_id)
    {
        return $this->asArray()
            ->where('utilisateur_id', $utilisateur_id)
            ->first();

SELECT "utilisateurs"."nom", "comptes"."solde"
FROM "comptes"
JOIN "utilisateurs" ON "utilisateurs"."id" = "comptes"."utilisateur_id"
ORDER BY "comptes"."solde" DESC
 LIMIT 5
---
    public function topUsersBySolde($limit = 5)
    {
        return $this->select('utilisateurs.nom, comptes.solde')
            ->join('utilisateurs', 'utilisateurs.id = comptes.utilisateur_id')
            ->orderBy('comptes.solde', 'DESC')
            ->limit($limit)
            ->findAll();