app/Models/GenreModel.php

    public function getAll(): array
    {
        return $this->orderBy('nom', 'ASC')->findAll();
---
SELECT *
FROM "genres"
ORDER BY "nom" ASC