app/Models/ImcModel.php

    public function getCategorie($imc)
    {
        $row = $this->db->table('imc_categories')
            ->where('imc_min <=', $imc)
            ->where('imc_max >=', $imc)
            ->get()
            ->getRowArray();
---
SELECT *
FROM "imc_categories"
WHERE "imc_min" <= 19.98
AND "imc_max" >= 19.98