app/Models/ObjectifModel.php

	public function getObjectifsUtilisateur(int $utilisateur_id): array
	{
		return $this->db->table('utilisateur_objectifs uo')
			->select('uo.id as utilisateur_objectif_id, uo.utilisateur_id, uo.objectif_id, uo.valeur_cible, uo.statut, uo.date_creation, o.libelle')
			->join('objectifs o', 'o.id = uo.objectif_id', 'inner')
			->where('uo.utilisateur_id', $utilisateur_id)
			->orderBy('o.libelle', 'ASC')
			->get()
			->getResultArray();
---
SELECT "uo"."id" as "utilisateur_objectif_id", "uo"."utilisateur_id", "uo"."objectif_id", "uo"."valeur_cible", "o"."libelle"
FROM "utilisateur_objectifs" "uo"
INNER JOIN "objectifs" "o" ON "o"."id" = "uo"."objectif_id"
WHERE "uo"."utilisateur_id" = 3
ORDER BY "o"."libelle" ASC