app/Models/ObjectifModel.php

SELECT *
FROM "objectifs"
ORDER BY "libelle" ASC
---
	public function getAll(): array
	{
		return $this->orderBy('libelle', 'ASC')->findAll();

SELECT "uo"."id" as "utilisateur_objectif_id", "uo"."utilisateur_id", "uo"."objectif_id", "uo"."valeur_cible", "uo"."statut", "uo"."date_creation", "o"."libelle"
FROM "utilisateur_objectifs" "uo"
INNER JOIN "objectifs" "o" ON "o"."id" = "uo"."objectif_id"
WHERE "uo"."utilisateur_id" = 3
ORDER BY "uo"."date_creation" DESC
---
	public function getObjectifsUtilisateur(int $utilisateur_id): array
	{
		return $this->db->table('utilisateur_objectifs uo')
			->select('uo.id as utilisateur_objectif_id, uo.utilisateur_id, uo.objectif_id, uo.valeur_cible, uo.statut, uo.date_creation, o.libelle')
			->join('objectifs o', 'o.id = uo.objectif_id', 'inner')
			->where('uo.utilisateur_id', $utilisateur_id)
			->orderBy('uo.date_creation', 'DESC')
			->get()
			->getResultArray();

SELECT "objectifs"."libelle", COUNT(utilisateur_objectifs.id) as total
FROM "objectifs"
JOIN "utilisateur_objectifs" ON "utilisateur_objectifs"."objectif_id" = "objectifs"."id"
GROUP BY "objectifs"."libelle"
---
		public function repartitionObjectifs()
	{
		return $this->select('objectifs.libelle, COUNT(utilisateur_objectifs.id) as total')
			->join('utilisateur_objectifs', 'utilisateur_objectifs.objectif_id = objectifs.id')
			->groupBy('objectifs.libelle')
			->findAll();

SELECT "uo".*, "o"."libelle"
FROM "utilisateur_objectifs" "uo"
INNER JOIN "objectifs" "o" ON "o"."id" = "uo"."objectif_id"
WHERE "uo"."utilisateur_id" = 6
AND "uo"."statut" = 'en_cours'
ORDER BY "uo"."date_creation" DESC
---
	public function getDernierObjectifEnCours(int $utilisateur_id)
	{
		return $this->db->table('utilisateur_objectifs uo')
			->select('uo.*, o.libelle')
			->join('objectifs o', 'o.id = uo.objectif_id', 'inner')
			->where('uo.utilisateur_id', $utilisateur_id)
			->where('uo.statut', 'en_cours')
			->orderBy('uo.date_creation', 'DESC')
			->get()
			->getRowArray();