app/Models/RegimeModel.php

SELECT *
FROM "regimes"
ORDER BY "libelle" ASC
---
	public function getAll(): array
	{
		return $this->orderBy('libelle', 'ASC')->findAll();

SELECT COUNT(*) AS "numrows"
FROM "regimes"
---
	public function countAllRegimes()
	{
		return $this->countAllResults();

SELECT "r"."id", "r"."libelle", COUNT(rec.aliment_id) as nb_aliments, 5000 as "prix_base"
FROM "regimes" "r"
LEFT JOIN "recettes" "rec" ON "rec"."regime_id" = "r"."id"
GROUP BY "r"."id"
---
	public function getRegimesAvecStats()
	{
		return $this->db->table('regimes r')
			->select('r.id, r.libelle, COUNT(rec.aliment_id) as nb_aliments, 5000 as prix_base')
			->join('recettes rec', 'rec.regime_id = r.id', 'left')
			->groupBy('r.id')
			->get()
			->getResultArray();