app/Models/SportModel.php

SELECT *
FROM "objectifs"
WHERE "id" = 1
SELECT *
FROM "sports"
ORDER BY "calories_par_heure" DESC
 LIMIT 5
SELECT *
FROM "sports"
ORDER BY "calories_par_heure" ASC
 LIMIT 5
---
    public function getSportsRecommandes($objectif_id = null, $imc = null): array
    {
        if ($objectif_id !== null) {
            $obj = $this->db->table('objectifs')->where('id', $objectif_id)->get()->getRowArray();
            $libelle = $obj ? strtolower($obj['libelle']) : null;
        } else {
            $libelle = null;
        }

        if ($libelle === 'perte de poids') {
            return $this->orderBy('calories_par_heure', 'DESC')->findAll(5);
        }

        if ($libelle === 'prise de masse') {
            return $this->orderBy('calories_par_heure', 'ASC')->findAll(5);
        }

        return $this->orderBy('calories_par_heure', 'DESC')->findAll(5);