app/Models/SuggestionModel.php

SELECT "id", "libelle"
FROM "regimes"
---
    public function getSuggestionRegime(?string $objectif = null, ?float $valeur = 0): array
    {
        // Cas sans objectif donc garder le random
        if ($objectif === null) {
            $regime = $this->db->table('regimes')
                ->select('id, libelle')
                ->orderBy('RANDOM()')
                ->limit(1)
                ->get()
                ->getRowArray();

            if ($regime) {
                $regime['description'] = 'Régime équilibré pour votre bien-être';
                $regime['duree_jours'] = 30;
                $regime['recettes'] = $this->getRecettesForRegime($regime['id']);
                return $regime;
            }
            return [];
        }

        //  tous les regimes
        $regimes = $this->db->table('regimes')
            ->select('id, libelle')
            ->get()
            ->getResultArray();

SELECT "a"."calories_100g", "a"."proteines_100g", "a"."lipides_100g"
FROM "recettes" "r"
JOIN "aliments" "a" ON "a"."id" = "r"."aliment_id"
WHERE "r"."regime_id" = '1'
---

        foreach ($regimes as $regime) {

            $aliments = $this->db->table('recettes r')
                ->select('a.calories_100g, a.proteines_100g, a.lipides_100g')
                ->join('aliments a', 'a.id = r.aliment_id')
                ->where('r.regime_id', $regime['id'])
                ->get()
                ->getResultArray();

SELECT "r"."pourcentage", "a"."nom", "a"."calories_100g", "a"."proteines_100g", "a"."glucides_100g", "a"."lipides_100g"
FROM "recettes" "r"
INNER JOIN "aliments" "a" ON "a"."id" = "r"."aliment_id"
WHERE "r"."regime_id" = 6
ORDER BY "r"."pourcentage" DESC
---
    public function getRecettesForRegime(int $regimeId): array
    {
        $recettes = $this->db->table('recettes r')
            ->select('r.pourcentage, a.nom, a.calories_100g, a.proteines_100g, a.glucides_100g, a.lipides_100g')
            ->join('aliments a', 'a.id = r.aliment_id', 'inner')
            ->where('r.regime_id', $regimeId)
            ->orderBy('r.pourcentage', 'DESC')
            ->get()
            ->getResultArray();

SELECT "o"."libelle", "uo"."valeur_cible"
FROM "utilisateur_objectifs" "uo"
INNER JOIN "objectifs" "o" ON "o"."id" = "uo"."objectif_id"
WHERE "uo"."utilisateur_id" = 3
AND "uo"."statut" = 'en_cours'
ORDER BY "uo"."date_creation" DESC
---
    public function getObjectifPrincipalUtilisateur(int $utilisateurId): ?array
    {
        $objectif = $this->db->table('utilisateur_objectifs uo')
            ->select('o.libelle, uo.valeur_cible')
            ->join('objectifs o', 'o.id = uo.objectif_id', 'inner')
            ->where('uo.utilisateur_id', $utilisateurId)
            ->where('uo.statut', 'en_cours')
            ->orderBy('uo.date_creation', 'DESC')
            ->get()
            ->getRowArray();