app/Models/SuggestionModel.php

SELECT "r"."pourcentage", "a"."nom", "a"."calories_100g", "a"."proteines_100g", "a"."glucides_100g", "a"."lipides_100g"
FROM "recettes" "r"
INNER JOIN "aliments" "a" ON "a"."id" = "r"."aliment_id"
WHERE "r"."regime_id" = 6
ORDER BY "r"."pourcentage" DESC
---
    private function getRecettesForRegime(int $regimeId): array
    {
        $recettes = $this->db->table('recettes r')
            ->select('r.pourcentage, a.nom, a.calories_100g, a.proteines_100g, a.glucides_100g, a.lipides_100g')
            ->join('aliments a', 'a.id = r.aliment_id', 'inner')
            ->where('r.regime_id', $regimeId)
            ->orderBy('r.pourcentage', 'DESC')
            ->get()
            ->getResultArray();

SELECT "o"."libelle"
FROM "utilisateur_objectifs" "uo"
INNER JOIN "objectifs" "o" ON "o"."id" = "uo"."objectif_id"
WHERE "uo"."utilisateur_id" = 3
AND "uo"."statut" = 'en_cours'
ORDER BY "uo"."date_creation" DESC
---
    public function getObjectifPrincipalUtilisateur(int $utilisateurId): ?string
    {
        $objectifs = $this->db->table('utilisateur_objectifs uo')
            ->select('o.libelle')
            ->join('objectifs o', 'o.id = uo.objectif_id', 'inner')
            ->where('uo.utilisateur_id', $utilisateurId)
            ->where('uo.statut', 'en_cours')
            ->orderBy('uo.date_creation', 'DESC')
            ->get()
            ->getResultArray();