app/Models/TransactionModel.php

SELECT *
FROM "transactions"
WHERE "compte_id" = 2
ORDER BY "date_transaction" DESC
 LIMIT 5
---
    public function getLatestByCompte(int $compte_id, int $limit = 5): array
    {
        return $this->asArray()
            ->where('compte_id', $compte_id)
            ->orderBy('date_transaction', 'DESC')
            ->findAll($limit);