app/Models/UtilisateurModel.php

SELECT *
FROM "utilisateurs"
WHERE "id" = 3
 LIMIT 1
---
    public function getById(int $id)
    {
        return $this->asArray()->where('id', $id)->first();

SELECT *
FROM "utilisateurs"
WHERE "email" = 'nyny@gmail.com'
 LIMIT 1
---
    public function getByEmail(string $email)
    {
        return $this->asArray()->where('email', $email)->first();

SELECT COUNT(*) AS "numrows"
FROM "utilisateurs"
WHERE "role_id" = 2
---
    public function countByRole(int $roleId)
    {
        return $this->db->table('utilisateurs')->where('role_id', $roleId)->countAllResults();

SELECT DATE_TRUNC('month', date_creation) AS mois, COUNT(*) AS total
FROM "utilisateurs"
GROUP BY "mois"
ORDER BY "mois" ASC
---
    public function inscriptionsParMois()
    {
        return $this->select("DATE_TRUNC('month', date_creation) AS mois, COUNT(*) AS total")
                    ->groupBy("mois")
                    ->orderBy("mois", "ASC")
                    ->findAll();